# 그룹화

동일한 값을 가진것들끼리 합쳐서 통계 또는 평균등의값을 계산하기 위해 사용

- groupby()

In [1]:
import pandas as pd

df = pd.read_csv('score.csv', encoding='utf-8-sig', index_col = '지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회         SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85       Python
2번    정대만  북산고  184   40   35   50  55  25        Java
3번    송태섭  북산고  168   80   75   70  80  75  Javascript
4번    서태웅  북산고  187   40   60   70  75  80          NaN
5번    강백호  북산고  188   15   20   10  35  10          NaN
6번    변덕규  능남고  202   80  100   95  85  80            C
7번    황태산  능남고  188   55   65   45  40  35       PYTHON
8번    윤대협  능남고  190  100   85   90  95  95           C#

In [4]:
df['학교'].unique()

array(['북산고', '능남고'], dtype=object)

In [5]:
#학교로 그룹화 한 다음 북산고/능남고 학생의 데이터만 확인
df.groupby('학교').get_group('북산고')
df.groupby('학교').get_group('능남고')

       이름   학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
6번    변덕규  능남고  202   80  100  95  85  80       C
7번    황태산  능남고  188   55   65  45  40  35  PYTHON
8번    윤대협  능남고  190  100   85  90  95  95      C#

In [6]:
#각 그룹의 크기
df.groupby('학교').size()

학교
능남고    3
북산고    5
dtype: int64

In [21]:
df.groupby('학교')[['국어','영어','수학']].mean()

            국어         영어         수학
학교
능남고  78.333333  83.333333  76.666667
북산고  53.000000  55.000000  60.000000

In [42]:
DataFrameGroupBy.mean(numeric_only=False, engine='cython', engine_kwargs=None)

Changed in version 2.0.0: numeric_only no longer accepts None and defaults to
    
https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.mean.html?highlight=groupby%20mean#pandas.core.groupby.DataFrameGroupBy.mean

SyntaxError: invalid syntax (2223474971.py, line 1)

In [22]:
df['학년'] = [3,3,2,1,1,3,2,2]

In [44]:
df.groupby(['학교','학년']).mean(numeric_only = True)

            키    국어     영어    수학    과학    사회
학교  학년
능남고 2   189.0  77.5   75.0  67.5  67.5  65.0
    3   202.0  80.0  100.0  95.0  85.0  80.0
북산고 1   187.5  27.5   40.0  40.0  55.0  45.0
    2   168.0  80.0   75.0  70.0  80.0  75.0
    3   190.5  65.0   60.0  75.0  75.0  55.0

In [32]:
df.groupby('학교')[['이름','SW특기']].count()

     이름  SW특기
학교
능남고   3     3
북산고   5     3

In [33]:
df.groupby('학교').count()

     이름  키  국어  영어  수학  과학  사회  SW특기  학년
학교
능남고   3  3   3   3   3   3   3     3   3
북산고   5  5   5   5   5   5   5     3   5

In [35]:
df.groupby('학교')['학년'].value_counts().loc['북산고']

학년
1    2
3    2
2    1
Name: count, dtype: int64

In [37]:
df.groupby('학교')['학년'].value_counts(normalize=True).loc['북산고']

학년
1    0.4
3    0.4
2    0.2
Name: proportion, dtype: float64